app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    todo_string = Todo.find(id).to_pleasant_string

INSERT INTO "todos" ("todo_text", "due_date", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["todo_text", "1st feb todo"], ["due_date", "2021-02-17"], ["completed", false], ["created_at", "2021-02-01 14:23:34.794888"], ["updated_at", "2021-02-01 14:23:34.794888"]]
---
  def create
    todo_text = params[:todo_text]
    due_date = DateTime.parse(params[:due_date])
    created_todo = Todo.create!(todo_text: todo_text, due_date: due_date, completed: false)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2021-02-01 14:33:59.726935"], ["id", 11]]
---
  def update
    todo_id = params[:id]
    due_date = params[:due_date]

    todo = Todo.find(todo_id)

    if due_date
      todo.due_date = due_date
    end

    completed = params[:completed]
    todo.completed = completed

    todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]
---
  def destroy
    id = params[:id]
    todo = Todo.find(id)
    todo.destroy!