app/controllers/users_controller.rb

  def index
    render plain: User.all.map { |user| user.to_presentable_string }.join("\n")
---
SELECT "users".* FROM "users"

  def show
    id = params[:id]
    user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    name = params[:name]
    email = params[:email]
    pwd = params[:password]

    saved = User.create!({
      :name => name,
      :email => email,
      :password => pwd,
    })
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aswath"], ["email", "aswath.18cs@kct.ac.in"], ["password", "HelloPass"], ["created_at", "2021-01-26 09:14:12.564073"], ["updated_at", "2021-01-26 09:14:12.564073"]]

  def update
    id = params[:id]

    name = params[:name]
    email = params[:email]
    pwd = params[:password]

    # Get the user from the DB.
    user = User.find(id)

    if name
      user.name = name
    end

    if email
      user.email = email
    end

    if pwd
      user.password = pwd
    end

    user.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "heyyeah@hey.org"], ["updated_at", "2021-01-26 09:18:55.922988"], ["id", 2]]

  def login
    email = params[:email]
    pwd = params[:password]

    render plain: User.where(email: email, password: pwd).exists?
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "aswath.18cs@kct.ac.in"], ["password", "Shreyas641!"], ["LIMIT", 1]]